#include<stdio.h>
int main()
{
    int a = 0;//四个字节，32个bit位
    int b = ~a;//b是有符号的整形
    //~ —— 按（2进制）位取反
    //00000000000000000000000000000000
    //11111111111111111111111111111111
    //原码，               反码，                 补码
    //直接按照正负          原码的符号位不变        反码+1
    //写出的二进制序列       其他位按位取反得到
    //负数在内存中存储的时候，存储的是二进制的补码
    //11111111111111111111111111111111（补码）
    //11111111111111111111111111111110（补码解1的到反码）
    //10000000000000000000000000000001（最前面第一位是符号位，反码的符号位不变，其他位按位取反得-1）
    printf("%d\n",b);
    return 0;
}